app/controllers/admin_controller.rb

SELECT COUNT(*) FROM "users"
---
  def users_count
    @users_count = User.count