app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
      unless @items = Item.all

INSERT INTO "items" ("name", "description", "price", "weight", "real", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "\"1\""], ["description", "\"good car\""], ["price", 500000.0], ["weight", 0.0], ["real", "t"], ["created_at", "2016-04-12 19:53:49.257525"], ["updated_at", "2016-04-12 19:53:49.257525"]]
---
  def create
    item_params = params.require(:item).permit(:name, :description, :price, :weight, :real)
    @item = Item.create(item_params)

UPDATE "items" SET "description" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["description", "зеленый http://www.vhlru.ru/upload/medialibrary/1f7/vzvzjb.jpg"], ["updated_at", "2016-04-16 20:03:09.638625"], ["id", 14]]
---
  def update
    item_params = params.require(:item).permit(:name, :description, :price, :weight, :real)
    @item.update_attributes(item_params)

UPDATE "items" SET "votes_count" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["votes_count", 1], ["updated_at", "2016-04-14 21:58:57.330121"], ["id", 14]]
---
  def upvote
    @item.increment!(:votes_count)

SELECT "items".* FROM "items" WHERE (price > 1000)
---
  def expensive
    @items = Item.where("price > 1000")

SELECT  "items".* FROM "items" WHERE "items"."id" = ?  ORDER BY "items"."id" ASC LIMIT 1  [["id", 16]]
---
    def find_item
      @item = Item.where(id: params[:id]).first